app/controllers/estrenos_controller.rb

SELECT "estrenos".* FROM "estrenos" ORDER BY titulo LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "estrenos"
---
  def index
    @estrenos = Estreno.order("titulo").page(params[:page]).per(4)

SELECT "estrenos".* FROM "estrenos" WHERE "estrenos"."id" = ? LIMIT 1  [["id", "edit"]]
---
  def show
    @estreno = Estreno.find(params[:id])

SELECT "estrenos".* FROM "estrenos" WHERE "estrenos"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @estreno = Estreno.find(params[:id])

INSERT INTO "estrenos" ("bluray", "bluray3d", "clasificacion", "created_at", "dvd", "fecha", "imagen_content_type", "imagen_file_name", "imagen_file_size", "imagen_updated_at", "sinopsis", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @estreno = Estreno.new(params[:estreno])

    respond_to do |format|
      if @estreno.save

SELECT "estrenos".* FROM "estrenos" WHERE "estrenos"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "estrenos" SET "url" = 'http://www.youtube.com/watch?v=76RbWuFll0Y&feature=g-logo&context=G173f0LOTs3IKQABAA', "updated_at" = '2011-11-26 00:24:47.189363' WHERE "estrenos"."id" = 5
---
  def update
    @estreno = Estreno.find(params[:id])

    respond_to do |format|
      if @estreno.update_attributes(params[:estreno])

SELECT "estrenos".* FROM "estrenos" WHERE "estrenos"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "estrenos" WHERE "estrenos"."id" = ?  [["id", 7]]
---
  def destroy
    @estreno = Estreno.find(params[:id])
    @estreno.destroy

SELECT "estrenos".* FROM "estrenos" ORDER BY titulo LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "estrenos"
---
  def admin
    @estrenos = Estreno.order("titulo").page(params[:page]).per(4)